zephyrproject-rtos/zephyr/drivers/adc/adc_stm32.c
/*
 * Copyright (c) 2018 Kokoon Technology Limited
 * Copyright (c) 2019 Song Qiang <songqiang1304521@gmail.com>
 * Copyright (c) 2019 Endre Karlson
 * Copyright (c) 2020 Teslabs Engineering S.L.
 * Copyright (c) 2021 Marius Scholtz, RIC Electronics
 * Copyright (c) 2023 Hein Wessels, Nobleo Technology
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_adc

#include <errno.h>

#include <zephyr/drivers/adc.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/device.h>
#include <zephyr/kernel.h>
#include <zephyr/init.h>
#include <zephyr/toolchain.h>
#include <zephyr/sys/byteorder.h>
#include <soc.h>
#include <stm32_bitops.h>
#include <stm32_cache.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/policy.h>
#include <stm32_ll_adc.h>
#include <stm32_ll_system.h>
#if defined(CONFIG_SOC_SERIES_STM32N6X) || \
	defined(CONFIG_SOC_SERIES_STM32U3X) || \
	defined(CONFIG_SOC_SERIES_STM32U5X)
#include <stm32_ll_pwr.h>
#endif /* CONFIG_SOC_SERIES_STM32U5X */

#ifdef CONFIG_ADC_STM32_DMA
#include <zephyr/drivers/dma/dma_stm32.h>
#include <zephyr/drivers/dma.h>
#include <stm32_ll_dma.h>
#endif

#define ADC_CONTEXT_USES_KERNEL_TIMER
#define ADC_CONTEXT_ENABLE_ON_COMPLETE
#include "adc_context.h"

#define LOG_LEVEL CONFIG_ADC_LOG_LEVEL
#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(adc_stm32);

#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/irq.h>
#include <zephyr/mem_mgmt/mem_attr.h>

#if defined(CONFIG_SOC_SERIES_STM32H7X) || defined(CONFIG_SOC_SERIES_STM32H7RSX)
#include <zephyr/dt-bindings/memory-attr/memory-attr-arm.h>
#endif

#include <zephyr/linker/linker-defs.h>

#if defined(CONFIG_STM32_HAL2)
#define STM32_ADC_DECIMAL_NB_TO_CHANNEL	LL_ADC_DECIMAL_NB_TO_CHANNEL
#define STM32_ADC_COMMON_INSTANCE	ADC_COMMON_INSTANCE
#define STM32_IN_ADC_SINGLE_ENDED	LL_ADC_IN_SINGLE_ENDED
#define STM32_ADC_OVS_REG_CONTINUED	LL_ADC_OVS_REG_CONTINUED
#else /* CONFIG_STM32_HAL2 */
#define STM32_ADC_DECIMAL_NB_TO_CHANNEL	__LL_ADC_DECIMAL_NB_TO_CHANNEL
#define STM32_ADC_COMMON_INSTANCE	__LL_ADC_COMMON_INSTANCE
#if defined(LL_ADC_SINGLE_ENDED)
#define STM32_IN_ADC_SINGLE_ENDED	LL_ADC_SINGLE_ENDED
#endif /* LL_ADC_SINGLE_ENDED */
#if defined(LL_ADC_OVS_GRP_REGULAR_CONTINUED)
#define STM32_ADC_OVS_REG_CONTINUED	LL_ADC_OVS_GRP_REGULAR_CONTINUED
#endif /* LL_ADC_OVS_GRP_REGULAR_CONTINUED */
#endif /* CONFIG_STM32_HAL2 */

/* Here are some redefinitions of ADC versions for better readability */
#if defined(CONFIG_SOC_SERIES_STM32F3X)
#if defined(ADC1_V2_5)
#define STM32F37X_ADC /* F37x */
#elif defined(ADC5_V1_1)
#define STM32F3XX_ADC /* Other F3xx */
#endif /* ADC5_V1_1 */
#elif defined(CONFIG_SOC_SERIES_STM32H7X)
#if defined(ADC_VER_V5_V90)
#define STM32H72X_ADC /* H72x and H73x */
#elif defined(ADC_VER_V5_X)
#define STM32H74X_ADC /* H74x and H75x */
#elif defined(ADC_VER_V5_3)
#define STM32H7AX_ADC /* H7Ax and H7Bx */
#endif /* ADC_VER_V5_3 */
#endif /* CONFIG_SOC_SERIES_STM32H7X */

/*
 * Other ADC versions:
 * compat st_stm32f1_adc -> STM32F1, F37x (ADC1_V2_5)
 * compat st_stm32f4_adc -> STM32F2, F4, F7, L1
 */

/* Clock source values */
#define SYNC			1
#define ASYNC			2

/* Sequencer type */
#define SEQUENCER_FIXED		0
#define SEQUENCER_PROGRAMMABLE	1

/* Oversampler type */
#define OVERSAMPLER_NONE	0
#define OVERSAMPLER_MINIMAL	1
#define OVERSAMPLER_EXTENDED	2

/* Internal regulator type */
#define INTERNAL_REGULATOR_NONE			0
#define INTERNAL_REGULATOR_STARTUP_SW_DELAY	1
#define INTERNAL_REGULATOR_STARTUP_HW_STATUS	2

#define ANY_NUM_COMMON_SAMPLING_TIME_CHANNELS_IS(value) \
	(DT_INST_FOREACH_STATUS_OKAY_VARGS(IS_EQ_PROP_OR, \
					   num_sampling_time_common_channels,\
					   0, value) 0)

#define ANY_ADC_SEQUENCER_TYPE_IS(value) \
	(DT_INST_FOREACH_STATUS_OKAY_VARGS(IS_EQ_STRING_PROP, \
					   st_adc_sequencer,\
					   value, SEQUENCER_) 0)

#define ANY_ADC_OVERSAMPLER_TYPE_IS(value) \
	(DT_INST_FOREACH_STATUS_OKAY_VARGS(IS_EQ_STRING_PROP, \
					   st_adc_oversampler,\
					   value, OVERSAMPLER_) 0)

#define ANY_ADC_INTERNAL_REGULATOR_TYPE_IS(value) \
	(DT_INST_FOREACH_STATUS_OKAY_VARGS(IS_EQ_STRING_PROP, \
					   st_adc_internal_regulator,\
					   value, INTERNAL_REGULATOR_) 0)

#define ANY_ADC_HAS_DEEP_POWERDOWN \
	(DT_INST_FOREACH_STATUS_OKAY_VARGS(IS_EQ_PROP_OR, \
					   st_adc_has_deep_powerdown,\
					   0, 1) 0)

#define ANY_ADC_HAS_CHANNEL_PRESELECTION \
	(DT_INST_FOREACH_STATUS_OKAY_VARGS(IS_EQ_PROP_OR, \
					   st_adc_has_channel_preselection,\
					   0, 1) 0)

#define ANY_ADC_HAS_DIFFERENTIAL_SUPPORT \
	(DT_INST_FOREACH_STATUS_OKAY_VARGS(IS_EQ_PROP_OR, \
					   st_adc_has_differential_support,\
					   0, 1) 0)

#define ANY_CHILD_NODE_IS_DIFFERENTIAL(inst) \
	(DT_INST_FOREACH_CHILD_VARGS(inst, IS_EQ_NODE_PROP_OR, \
				     zephyr_differential, \
				     0, 1) 0)

#define IS_EQ_PROP_OR(inst, prop, default_value, compare_value) \
	IS_EQ(DT_INST_PROP_OR(inst, prop, default_value), compare_value) ||

#define IS_EQ_NODE_PROP_OR(node, prop, default_value, compare_value) \
	IS_EQ(DT_PROP_OR(node, prop, default_value), compare_value) ||

#define IS_EQ_STRING_PROP(inst, prop, compare_value, prefix) \
	IS_EQ(CONCAT(prefix, DT_INST_STRING_UPPER_TOKEN(inst, prop)), compare_value) ||

/* reference voltage for the ADC */
#define STM32_ADC_VREF_MV DT_INST_PROP(0, vref_mv)

#if ANY_ADC_SEQUENCER_TYPE_IS(SEQUENCER_PROGRAMMABLE)

#if defined(LL_ADC_REG_RANK_28)
#define MAX_RANK	28
#elif defined(LL_ADC_REG_RANK_27)
#define MAX_RANK	27
#else
#define MAX_RANK	16
#endif

#define RANK(i, _)	CONCAT(LL_ADC_REG_RANK_, UTIL_INC(i))
static const uint32_t table_rank[] = {
	LISTIFY(MAX_RANK, RANK, (,))};

#define SEQ_LEN(i, _)	CONCAT(LL_ADC_REG_SEQ_SCAN_ENABLE_, UTIL_INC(UTIL_INC(i)), RANKS)
/* Length of this array signifies the maximum sequence length */
static const uint32_t table_seq_len[] = {
	LL_ADC_REG_SEQ_SCAN_DISABLE,
	LISTIFY(UTIL_DEC(MAX_RANK), SEQ_LEN, (,))
};

#endif /* ANY_ADC_SEQUENCER_TYPE_IS(SEQUENCER_PROGRAMMABLE) */

#ifdef CONFIG_ADC_STM32_INJECTED_CHANNELS

#define STM32_REG_SEQ_PRIORITY	0U
#define STM32_INJ_SEQ_PRIORITY	1U

/* Max number of injected channels  */
#define STM32_NB_INJECTED_CHANNELS	4

/* This macro, coupled with listify, creates an array containing values LL_ADC_INJ_RANK_x,
 * where x ranges from 1 to STM32_NB_INJECTED_CHANNELS
 */
#define INJ_RANK(i, _)	CONCAT(LL_ADC_INJ_RANK_, UTIL_INC(i))
static const uint32_t table_inj_rank[] = {
	LISTIFY(STM32_NB_INJECTED_CHANNELS, INJ_RANK, (,))
};

/* This macro, coupled with listify, creates an array containing values
 * LL_ADC_INJ_SEQ_SCAN_ENABLE_x_RANKS, where x ranges from 2 to STM32_NB_INJECTED_CHANNELS
 */
#define INJ_SEQ_LEN(i, _)	CONCAT(LL_ADC_INJ_SEQ_SCAN_ENABLE_, UTIL_INC(UTIL_INC(i)), RANKS)
/* Length of this array signifies the maximum sequence length */
static const uint32_t table_inj_seq_len[] = {
	LL_ADC_INJ_SEQ_SCAN_DISABLE,
	LISTIFY(UTIL_DEC(STM32_NB_INJECTED_CHANNELS), INJ_SEQ_LEN, (,))
};

#endif /* CONFIG_ADC_STM32_INJECTED_CHANNELS */

/* Number of different sampling time values */
#define STM32_NB_SAMPLING_TIME	8

#ifdef CONFIG_ADC_STM32_DMA
struct stream {
	const struct device *dma_dev;
	uint32_t channel;
	struct dma_config dma_cfg;
	struct dma_block_config dma_blk_cfg;
	uint8_t priority;
	bool src_addr_increment;
	bool dst_addr_increment;
};
