zephyrproject-rtos/zephyr/drivers/adc/adc_stm32.c
	for (i = 0; i < config->table_resolution_size; i++) {
		if (sequence->resolution == config->table_raw_resolution[i]) {
			break;
		}
	}

	if (i == config->table_resolution_size) {
		LOG_ERR("Invalid resolution");
		return -EINVAL;
	}

#if !DT_HAS_COMPAT_STATUS_OKAY(st_stm32f1_adc)
	if (LL_ADC_GetResolution(adc) != config->table_ll_resolution[i]) {
		err = adc_stm32_disable(adc, false);
		if (err == 0) {
			LL_ADC_SetResolution(adc, config->table_ll_resolution[i]);
		}
	}
#endif /* !DT_HAS_COMPAT_STATUS_OKAY(st_stm32f1_adc) */

	return err;
}

#if ANY_ADC_HAS_CHANNEL_PRESELECTION
static int adc_stm32_preselection_setup(const struct device *dev, uint32_t channel_id)
{
	const struct adc_stm32_cfg *config = (const struct adc_stm32_cfg *)dev->config;
	ADC_TypeDef *adc = config->base;
	uint32_t channel = STM32_ADC_DECIMAL_NB_TO_CHANNEL(channel_id);
	int err;
#ifdef STM32H72X_ADC
	volatile uint32_t *pcsel_reg = &adc->PCSEL_RES0;
#else /* STM32H72X_ADC */
	volatile uint32_t *pcsel_reg = &adc->PCSEL;
#endif /* STM32H72X_ADC */

	if (!config->has_channel_preselection ||
	    (stm32_reg_read(pcsel_reg) & BIT(channel_id)) == BIT(channel_id)) {
		/* Nothing to configure */
		return 0;
	}

	err = adc_stm32_disable(adc, false);

	if (err == 0) {
		/* Each channel in the sequence must be previously enabled in PCSEL.
		 * This register controls the analog switch integrated in the IO level.
		 */
		LL_ADC_SetChannelPreselection(adc, channel);
	}

	return err;
}
#endif /* ANY_ADC_HAS_CHANNEL_PRESELECTION */

static int set_sequencer(const struct device *dev)
{
	const struct adc_stm32_cfg *config = dev->config;
	struct adc_stm32_data *data = dev->data;
	ADC_TypeDef *adc = config->base;

	uint8_t channel_id;
	uint8_t channel_index = 0;
	uint32_t channels_mask = 0;

	/* Iterate over selected channels in bitmask keeping track of:
	 * - channel_index: ranging from 0 -> ( data->channel_count - 1 )
	 * - channel_id: ordinal position of channel in data->channels bitmask
	 */
	for (uint32_t channels = data->channels; channels;
		      channels &= ~BIT(channel_id), channel_index++) {
		channel_id = find_lsb_set(channels) - 1;

		uint32_t channel = STM32_ADC_DECIMAL_NB_TO_CHANNEL(channel_id);

		channels_mask |= channel;

#if ANY_ADC_SEQUENCER_TYPE_IS(SEQUENCER_PROGRAMMABLE)
		if (config->sequencer_type == SEQUENCER_PROGRAMMABLE) {
			LL_ADC_REG_SetSequencerRanks(adc, table_rank[channel_index], channel);
			LL_ADC_REG_SetSequencerLength(adc, table_seq_len[channel_index]);
		}
#endif /* ANY_ADC_SEQUENCER_TYPE_IS(SEQUENCER_PROGRAMMABLE) */

#if ANY_ADC_HAS_CHANNEL_PRESELECTION && !defined(CONFIG_ADC_STM32_INJECTED_CHANNELS)
		int err = adc_stm32_preselection_setup(dev, channel_id);

		if (err < 0) {
			return err;
		}
#endif /* ANY_ADC_HAS_CHANNEL_PRESELECTION */
	}

#if ANY_ADC_SEQUENCER_TYPE_IS(SEQUENCER_FIXED)
	if (config->sequencer_type == SEQUENCER_FIXED) {
		LL_ADC_REG_SetSequencerChannels(adc, channels_mask);

#ifdef LL_ADC_FLAG_CCRDY
		/*
		 * After modifying sequencer it is mandatory to wait for the
		 * assertion of CCRDY flag
		 */
		while (LL_ADC_IsActiveFlag_CCRDY(adc) == 0) {
		}
		LL_ADC_ClearFlag_CCRDY(adc);
#endif /* LL_ADC_FLAG_CCRDY */
	}
#endif /* ANY_ADC_SEQUENCER_TYPE_IS(SEQUENCER_FIXED) */

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32f1_adc) || \
	DT_HAS_COMPAT_STATUS_OKAY(st_stm32f4_adc)
	LL_ADC_SetSequencersScanMode(adc, LL_ADC_SEQ_SCAN_ENABLE);
#endif /* st_stm32f1_adc || st_stm32f4_adc */

	return 0;
}

#ifdef CONFIG_ADC_STM32_INJECTED_CHANNELS
static int set_inj_sequencer(const struct device *dev)
{
	const struct adc_stm32_cfg *config = dev->config;
	struct adc_stm32_data *data = dev->data;
	ADC_TypeDef *adc = config->base;
	uint32_t channels = data->inj_channels;
	uint8_t channel_count = data->inj_channel_count;

	/* For F1 and F4 compatibles, it is essential to configure the injected sequencer length
	 * first because the function LL_ADC_INJ_SetSequencerRanks uses this length to properly
	 * configure the ranks. Use this sequence on all SoCs for sake of simplicity.
	 */
	LL_ADC_INJ_SetSequencerLength(adc, table_inj_seq_len[channel_count - 1]);

	for (uint8_t i = 0; i < channel_count && channels != 0; i++) {
		uint8_t channel_id = find_lsb_set(channels) - 1;
		uint32_t channel = STM32_ADC_DECIMAL_NB_TO_CHANNEL(channel_id);

		LL_ADC_INJ_SetSequencerRanks(adc, table_inj_rank[i], channel);

		channels &= ~BIT(channel_id);
	}

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32f1_adc) || DT_HAS_COMPAT_STATUS_OKAY(st_stm32f4_adc)
	LL_ADC_SetSequencersScanMode(adc, LL_ADC_SEQ_SCAN_ENABLE);
#endif /* st_stm32f1_adc || st_stm32f4_adc */

	return 0;
}

static int start_inj_read(const struct device *dev, const struct adc_sequence *sequence)
{
	const struct adc_stm32_cfg *config = dev->config;
	struct adc_stm32_data *data = dev->data;
	ADC_TypeDef *adc = config->base;
	int err;

	data->inj_buffer = sequence->buffer;
	data->inj_channels = sequence->channels;
	data->inj_channel_count = POPCOUNT(data->inj_channels);

	if (data->inj_channel_count == 0) {
		LOG_ERR("No channels selected");
		return -EINVAL;
	}

	if (data->inj_channel_count > STM32_NB_INJECTED_CHANNELS) {
		LOG_ERR("Too many channels for injected sequencer. Max: %d",
			STM32_NB_INJECTED_CHANNELS);
		return -EINVAL;
	}

	err = check_buffer(sequence, data->inj_channel_count);
	if (err < 0) {
		LOG_ERR("ADC buffer error");
		return err;
	}

	err = set_resolution(dev, sequence);
	if (err < 0) {
		LOG_ERR("Error setting the ADC resolution");
		return err;
	}

	/* Configure the sequencer */
	err = set_inj_sequencer(dev);
	if (err < 0) {
		LOG_ERR("Error setting the ADC injected sequencer");
		return err;
	}

	adc_stm32_enable(adc);

	LL_ADC_EnableIT_JEOS(adc);

	adc_context_start_read(&data->inj_ctx, sequence);

	return adc_context_wait_for_completion(&data->inj_ctx);
}
#endif /* CONFIG_ADC_STM32_INJECTED_CHANNELS */

static int start_read(const struct device *dev,
		      const struct adc_sequence *sequence)
{
	const struct adc_stm32_cfg *config = dev->config;
	struct adc_stm32_data *data = dev->data;
	ADC_TypeDef *adc = config->base;
	int err;

	data->buffer = sequence->buffer;
	data->channels = sequence->channels;
	data->channel_count = POPCOUNT(data->channels);
	data->samples_count = 0;
	data->resolution = sequence->resolution;

