zephyrproject-rtos/zephyr/drivers/adc/adc_stm32.c
	if (data->channel_count == 0) {
		LOG_ERR("No channels selected");
		return -EINVAL;
	}

#if ANY_ADC_SEQUENCER_TYPE_IS(SEQUENCER_PROGRAMMABLE)
	if (data->channel_count > ARRAY_SIZE(table_seq_len)) {
		LOG_ERR("Too many channels for sequencer. Max: %d", ARRAY_SIZE(table_seq_len));
		return -EINVAL;
	}
#endif /* ANY_ADC_SEQUENCER_TYPE_IS(SEQUENCER_PROGRAMMABLE) */

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32f1_adc) && !defined(CONFIG_ADC_STM32_DMA)
	/* Multiple samplings is only supported with DMA for F1 */
	if (data->channel_count > 1) {
		LOG_ERR("Without DMA, this device only supports single channel sampling");
		return -EINVAL;
	}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32f1_adc) && !CONFIG_ADC_STM32_DMA */

	/* Check and set the resolution */
	err = set_resolution(dev, sequence);
	if (err < 0) {
		LOG_ERR("Error setting the ADC resolution");
		return err;
	}

	/* Configure the sequencer */
	err = set_sequencer(dev);
	if (err < 0) {
		LOG_ERR("Error setting the ADC sequencer");
		return err;
	}

#ifndef CONFIG_ADC_STREAM
	/*
	 * In streaming mode the application does not provide a buffer in the
	 * sequence: sample data is written to a buffer allocated from the RTIO
	 * mempool inside the ISR. Skip the sequence buffer validation here.
	 */
	err = check_buffer(sequence, data->channel_count);
	if (err) {
		LOG_ERR("ADC buffer error");
		return err;
	}
#endif /* !CONFIG_ADC_STREAM */

#ifdef HAS_OVERSAMPLING
	err = adc_stm32_oversampling(dev, sequence->oversampling);
	if (err) {
		LOG_ERR("Error setting the ADC oversampler");
		return err;
	}
#else
	if (sequence->oversampling) {
		LOG_ERR("Oversampling not supported");
		return -ENOTSUP;
	}
#endif /* HAS_OVERSAMPLING */

	if (sequence->calibrate) {
#if defined(HAS_CALIBRATION)
		err = adc_stm32_calibrate(dev, false);
		if (err < 0) {
			LOG_ERR("Calibration error");
			return err;
		}
#else
		LOG_ERR("Calibration not supported");
		return -ENOTSUP;
#endif
	}

	/*
	 * Make sure the ADC is enabled as it might have been disabled earlier
	 * to set the resolution, to set the oversampling or to perform the
	 * calibration.
	 */
	adc_stm32_enable(adc);

#if !DT_HAS_COMPAT_STATUS_OKAY(st_stm32f1_adc)
	LL_ADC_ClearFlag_OVR(adc);
#endif /* !DT_HAS_COMPAT_STATUS_OKAY(st_stm32f1_adc) */

#if !defined(CONFIG_ADC_STM32_DMA)
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32f4_adc)
	/* Trigger an ISR after each sampling (not just end of sequence) */
	LL_ADC_REG_SetFlagEndOfConversion(adc, LL_ADC_REG_FLAG_EOC_UNITARY_CONV);
	LL_ADC_EnableIT_EOCS(adc);
#elif DT_HAS_COMPAT_STATUS_OKAY(st_stm32f1_adc)
	LL_ADC_EnableIT_EOS(adc);
#else
	LL_ADC_EnableIT_EOC(adc);
#endif
#endif /* CONFIG_ADC_STM32_DMA */

#ifdef CONFIG_ADC_STREAM
	data->ctx.asynchronous = true;
	adc_context_start_sampling(&data->ctx);
#else /* CONFIG_ADC_STREAM */
	/* This call will start the DMA */
	adc_context_start_read(&data->ctx, sequence);
#endif /* CONFIG_ADC_STREAM */

	int result = adc_context_wait_for_completion(&data->ctx);

#ifdef CONFIG_ADC_STM32_DMA
	/* check if there's anything wrong with dma start */
	result = (data->dma_error ? data->dma_error : result);
#endif

	return result;
}

static void adc_context_start_sampling(struct adc_context *ctx)
{
#ifdef CONFIG_ADC_STM32_INJECTED_CHANNELS
	if (ctx->sequence.priority == STM32_INJ_SEQ_PRIORITY) {
		struct adc_stm32_data *inj_data =
			CONTAINER_OF(ctx, struct adc_stm32_data, inj_ctx);
		const struct device *inj_dev = inj_data->dev;

		adc_stm32_start_inj_conversion(inj_dev);
		return;
	}
#endif /* CONFIG_ADC_STM32_INJECTED_CHANNELS */

	struct adc_stm32_data *data =
		CONTAINER_OF(ctx, struct adc_stm32_data, ctx);
	const struct device *dev = data->dev;
	const struct adc_stm32_cfg *config = dev->config;
	__maybe_unused ADC_TypeDef *adc = config->base;

	data->repeat_buffer = data->buffer;

#ifdef CONFIG_ADC_STM32_DMA
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32f4_adc)
	/* Make sure DMA bit of ADC register CR2 is set to 0 before starting a DMA transfer */
	LL_ADC_REG_SetDMATransfer(adc, LL_ADC_REG_DMA_TRANSFER_NONE);
#endif
	adc_stm32_dma_start(dev, data->buffer, data->channel_count);
#endif
	adc_stm32_start_conversion(dev);
}

static void adc_context_update_buffer_pointer(struct adc_context *ctx,
					      bool repeat_sampling)
{
	struct adc_stm32_data *data =
		CONTAINER_OF(ctx, struct adc_stm32_data, ctx);

	if (repeat_sampling) {
		data->buffer = data->repeat_buffer;
	}
}

#if !defined(CONFIG_ADC_STM32_DMA) || defined(CONFIG_ADC_STM32_INJECTED_CHANNELS)
static void adc_stm32_isr(const struct device *dev)
{
	struct adc_stm32_data *data = dev->data;
	const struct adc_stm32_cfg *config = (const struct adc_stm32_cfg *)dev->config;
	ADC_TypeDef *adc = config->base;

#if !DT_HAS_COMPAT_STATUS_OKAY(st_stm32f1_adc)
	if (LL_ADC_IsActiveFlag_OVR(adc)) {
		LL_ADC_ClearFlag_OVR(adc);
		LOG_ERR("ADC overrun error occurred. Use DMA, reduce clock source frequency, "
			"increase prescaler value or increase sampling times.");
	}
#endif /* !DT_HAS_COMPAT_STATUS_OKAY(st_stm32f1_adc) */

#ifdef CONFIG_ADC_STM32_INJECTED_CHANNELS
	if (LL_ADC_IsActiveFlag_JEOS(adc) == 1) {
		LL_ADC_ClearFlag_JEOS(adc);
		for (uint8_t i = 0; i < data->inj_channel_count; i++) {
			*data->inj_buffer++ = LL_ADC_INJ_ReadConversionData32(adc,
							   table_inj_rank[i]);
		}

		adc_context_on_sampling_done(&data->inj_ctx, dev);
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

		if (IS_ENABLED(CONFIG_PM_S2RAM)) {
			pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_RAM, PM_ALL_SUBSTATES);
		}
	}
#endif /* CONFIG_ADC_STM32_INJECTED_CHANNELS */

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32f1_adc)
	if (LL_ADC_IsActiveFlag_EOS(adc) == 1) {
#elif DT_HAS_COMPAT_STATUS_OKAY(st_stm32f4_adc)
	if (LL_ADC_IsActiveFlag_EOCS(adc) == 1) {
#else
	if (LL_ADC_IsActiveFlag_EOC(adc) == 1) {
#endif

#ifndef CONFIG_ADC_STREAM
		*data->buffer++ = LL_ADC_REG_ReadConversionData32(adc);
		/* ISR is triggered after each conversion, and at the end-of-sequence. */
		if (++data->samples_count == data->channel_count) {
			data->samples_count = 0;
			adc_context_on_sampling_done(&data->ctx, dev);
			pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE,
						 PM_ALL_SUBSTATES);
			if (IS_ENABLED(CONFIG_PM_S2RAM)) {
				pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_RAM,
							 PM_ALL_SUBSTATES);
			}
		}
#else /* CONFIG_ADC_STREAM */
		if (data->samples_count == 0U) {
			uint8_t *buf;
			uint32_t buf_len;
			const size_t read_size = sizeof(struct adc_stm32_rtio_data) +
						 data->channel_count * sizeof(adc_data_size_t);
			struct adc_stm32_rtio_data *hdr;

			if (rtio_sqe_rx_buf(data->sqe, read_size, read_size, &buf, &buf_len) != 0) {
				rtio_iodev_sqe_err(data->sqe, -ENOMEM);
				return;
			}

			hdr = (struct adc_stm32_rtio_data *)buf;
			hdr->timestamp = k_ticks_to_ns_floor64(k_uptime_ticks());
			hdr->vref_mv = STM32_ADC_VREF_MV;
			hdr->res = data->resolution;
			hdr->channel_count = data->channel_count;
		}

		adc_data_size_t *read_buf = (adc_data_size_t *)(data->sqe->sqe.rx.buf +
					    sizeof(struct adc_stm32_rtio_data) +
					    data->samples_count * sizeof(adc_data_size_t));

		*read_buf = LL_ADC_REG_ReadConversionData32(adc);

		if (++data->samples_count == data->channel_count) {
			data->samples_count = 0;
			adc_context_on_sampling_done(&data->ctx, dev);
			rtio_iodev_sqe_ok(data->sqe, 0);
		}
#endif /* CONFIG_ADC_STREAM */
	}

	LOG_DBG("%s ISR triggered.", dev->name);
}
#endif /* !CONFIG_ADC_STM32_DMA */

static void adc_context_on_complete(struct adc_context *ctx, int status)
{
	struct adc_stm32_data *data =
		CONTAINER_OF(ctx, struct adc_stm32_data, ctx);
	const struct adc_stm32_cfg *config = data->dev->config;
	__maybe_unused ADC_TypeDef *adc = config->base;

