zephyrproject-rtos/zephyr/drivers/adc/adc_stm32.c
	ARG_UNUSED(status);

#ifndef CONFIG_ADC_STM32_INJECTED_CHANNELS
	/* Reset acquisition time used for the sequence */
	data->acq_time_index[0] = -1;
	data->acq_time_index[1] = -1;

#if ANY_ADC_HAS_CHANNEL_PRESELECTION
	if (config->has_channel_preselection) {
		/* Reset channel preselection register */
#ifdef STM32H72X_ADC
		stm32_reg_write(&adc->PCSEL_RES0, 0U);
#else /* STM32H72X_ADC */
		stm32_reg_write(&adc->PCSEL, 0U);
#endif /* STM32H72X_ADC */
	}
#endif /* ANY_ADC_HAS_CHANNEL_PRESELECTION */
#endif /* CONFIG_ADC_STM32_INJECTED_CHANNELS */
}

static int adc_stm32_read(const struct device *dev,
			  const struct adc_sequence *sequence,
			  struct k_poll_signal *async_sig,
			  bool asynchronous)
{
	struct adc_stm32_data *data = dev->data;
	int error;
	struct adc_context *ctx;
	int (*read_fn)(const struct device *dev, const struct adc_sequence *sequence);

#ifdef CONFIG_ADC_STM32_INJECTED_CHANNELS
	const struct adc_stm32_cfg *config = (const struct adc_stm32_cfg *)dev->config;
	bool is_injected;

	if (sequence->priority == STM32_REG_SEQ_PRIORITY) {
		is_injected = false;
	} else if (sequence->priority == STM32_INJ_SEQ_PRIORITY) {
		if (!config->has_injected_support) {
			LOG_ERR("Injected channels are not available on this ADC instance");
			return -ENOTSUP;
		}
		is_injected = true;
	} else {
		LOG_ERR("Sequence priority %d is invalid", sequence->priority);
		return -EINVAL;
	}
	ctx = is_injected ? &data->inj_ctx : &data->ctx;
	read_fn = is_injected ? start_inj_read : start_read;
#else /* CONFIG_ADC_STM32_INJECTED_CHANNELS */
	ctx = &data->ctx;
	read_fn = start_read;
#endif /* CONFIG_ADC_STM32_INJECTED_CHANNELS */

	adc_context_lock(ctx, asynchronous, async_sig);
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	if (IS_ENABLED(CONFIG_PM_S2RAM)) {
		pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_RAM, PM_ALL_SUBSTATES);
	}
	error = read_fn(dev, sequence);
	adc_context_release(ctx, error);

	return error;
}

static int adc_stm32_read_sync(const struct device *dev, const struct adc_sequence *sequence)
{
	return adc_stm32_read(dev, sequence, NULL, false);
}

#ifdef CONFIG_ADC_ASYNC
static int adc_stm32_read_async(const struct device *dev,
				 const struct adc_sequence *sequence,
				 struct k_poll_signal *async)
{
	return adc_stm32_read(dev, sequence, async, true);
}
#endif

static int adc_stm32_sampling_time_check(const struct device *dev, uint16_t acq_time)
{
	const struct adc_stm32_cfg *config =
		(const struct adc_stm32_cfg *)dev->config;

	if (acq_time == ADC_ACQ_TIME_DEFAULT) {
		return 0;
	}

	if (acq_time == ADC_ACQ_TIME_MAX) {
		return STM32_NB_SAMPLING_TIME - 1;
	}

	if (ADC_ACQ_TIME_UNIT(acq_time) != ADC_ACQ_TIME_TICKS) {
		LOG_ERR("Acquisition time expected in ticks only");
		return -EINVAL;
	}

	for (int i = 0; i < STM32_NB_SAMPLING_TIME; i++) {
		if (acq_time == ADC_ACQ_TIME(ADC_ACQ_TIME_TICKS,
					     config->sampling_time_table[i])) {
			return i;
		}
	}

	LOG_ERR("Sampling time value not supported.");
	return -EINVAL;
}

static int adc_stm32_sampling_time_setup(const struct device *dev, uint8_t id,
					 uint16_t acq_time)
{
	const struct adc_stm32_cfg *config =
		(const struct adc_stm32_cfg *)dev->config;
	ADC_TypeDef *adc = config->base;
	__maybe_unused struct adc_stm32_data *data = dev->data;

	int acq_time_index;

	acq_time_index = adc_stm32_sampling_time_check(dev, acq_time);
	if (acq_time_index < 0) {
		return acq_time_index;
	}

	/*
	 * For all series we use the fact that the macros LL_ADC_SAMPLINGTIME_*
	 * that should be passed to the set functions are all coded on 3 bits
	 * with 0 shift (ie 0 to 7). So acq_time_index is equivalent to the
	 * macro we would use for the desired sampling time.
	 */
	switch (config->num_sampling_time_common_channels) {
	case 0:
#if ANY_NUM_COMMON_SAMPLING_TIME_CHANNELS_IS(0)
		LL_ADC_SetChannelSamplingTime(adc,
					      STM32_ADC_DECIMAL_NB_TO_CHANNEL(id),
					      (uint32_t)acq_time_index);
#endif
		break;
	case 1:
#if ANY_NUM_COMMON_SAMPLING_TIME_CHANNELS_IS(1)
		/* Only one sampling time can be selected for all channels.
		 * The first one we find is used, all others must match.
		 */
		if ((data->acq_time_index[0] == -1) ||
			(acq_time_index == data->acq_time_index[0])) {
			/* Reg is empty or value matches */
			data->acq_time_index[0] = acq_time_index;
			LL_ADC_SetSamplingTimeCommonChannels(adc,
							     (uint32_t)acq_time_index);
		} else {
			/* Reg is used and value does not match */
			LOG_ERR("Multiple sampling times not supported. "
				"Previously configured sampling time remain reserved until the "
				"next ADC read.");
			return -EINVAL;
		}
#endif
		break;
	case 2:
#if ANY_NUM_COMMON_SAMPLING_TIME_CHANNELS_IS(2)
		/* Two different sampling times can be selected for all channels.
		 * The first two we find are used, all others must match either one.
		 */
		if ((data->acq_time_index[0] == -1) ||
			(acq_time_index == data->acq_time_index[0])) {
			/* 1st reg is empty or value matches 1st reg */
			data->acq_time_index[0] = acq_time_index;
			LL_ADC_SetChannelSamplingTime(adc,
						      STM32_ADC_DECIMAL_NB_TO_CHANNEL(id),
						      LL_ADC_SAMPLINGTIME_COMMON_1);
			LL_ADC_SetSamplingTimeCommonChannels(adc,
							     LL_ADC_SAMPLINGTIME_COMMON_1,
							     (uint32_t)acq_time_index);
		} else if ((data->acq_time_index[1] == -1) ||
			(acq_time_index == data->acq_time_index[1])) {
			/* 2nd reg is empty or value matches 2nd reg */
			data->acq_time_index[1] = acq_time_index;
			LL_ADC_SetChannelSamplingTime(adc,
						      STM32_ADC_DECIMAL_NB_TO_CHANNEL(id),
						      LL_ADC_SAMPLINGTIME_COMMON_2);
			LL_ADC_SetSamplingTimeCommonChannels(adc,
							     LL_ADC_SAMPLINGTIME_COMMON_2,
							     (uint32_t)acq_time_index);
		} else {
			/* Both regs are used, value does not match any of them */
			LOG_ERR("Only two different sampling times supported. "
				"Previously configured sampling times remain reserved until the "
				"next ADC read.");
			return -EINVAL;
		}
#endif
		break;
	default:
		LOG_ERR("Number of common sampling time channels not supported");
		return -EINVAL;
	}
	return 0;
}

#if ANY_ADC_HAS_DIFFERENTIAL_SUPPORT
static int set_channel_differential_mode(ADC_TypeDef *adc, uint8_t channel_id, bool differential)
{
	const uint32_t mode = differential ? LL_ADC_DIFFERENTIAL_ENDED : STM32_IN_ADC_SINGLE_ENDED;
	const uint32_t channel = STM32_ADC_DECIMAL_NB_TO_CHANNEL(channel_id);
	uint32_t current_mode = LL_ADC_GetChannelSingleDiff(adc, channel);
	int err;

	/* The ADC must be disabled to change the single ended / differential mode setting. The
	 * disable / re-enable cycle can take some time, so avoid doing this if the channel is
	 * already set to the correct mode.
	 */
	if ((current_mode != 0U && mode == LL_ADC_DIFFERENTIAL_ENDED) ||
	    (current_mode == 0U && mode == STM32_IN_ADC_SINGLE_ENDED)) {
		return 0;
	}

	err = adc_stm32_disable(adc, false);
	if (err < 0) {
		return err;
	}

