zephyrproject-rtos/zephyr/drivers/adc/adc_stm32.c
/*
 * return (irqn == device_irqn(index)) ? index : NULL
 */
#define FIRST_WITH_IRQN_INTERNAL(index, irqn)                                                      \
	COND_CODE_1(IS_EQ(irqn, DT_INST_IRQN(index)), (index,), (EMPTY,))

/*
 * Returns the "first" instance's index:
 *
 * instances = []
 * for instance in all_active_adcs:
 *     instances.append(first_with_irqn_internal(device_irqn(index)))
 * for instance in instances:
 *     if instance == NULL:
 *         instances.remove(instance)
 * return instances[0]
 */
#define FIRST_WITH_IRQN(index)                                                                     \
	GET_ARG_N(1, LIST_DROP_EMPTY(DT_INST_FOREACH_STATUS_OKAY_VARGS(FIRST_WITH_IRQN_INTERNAL,   \
								       DT_INST_IRQN(index))))

/*
 * Provides code for calling adc_stm32_isr for an instance if its IRQn
 * matches:
 *
 * if (irqn == device_irqn(index)):
 *     return "adc_stm32_isr(DEVICE_DT_INST_GET(index));"
 */
#define HANDLE_IRQS(index, irqn)                                                                   \
	COND_CODE_1(IS_EQ(irqn, DT_INST_IRQN(index)), (adc_stm32_isr(DEVICE_DT_INST_GET(index));), \
		    (EMPTY))

/*
 * Name of the common ISR for a given IRQn (taken from a device with a
 * given index). Example, for an ADC instance with IRQn 18, returns
 * "adc_stm32_isr_18".
 */
#define ISR_FUNC(index) UTIL_CAT(adc_stm32_isr_, DT_INST_IRQN(index))

/*
 * Macro for generating code for the common ISRs (by looping of all
 * ADC instances that share the same IRQn as that of the given device
 * by index) and the function for setting up the ISR.
 *
 * Here is where both "first" and non-"first" instances have code
 * generated for their interrupts via HANDLE_IRQS.
 */
#define GENERATE_ISR_CODE(index)                                                                   \
	static void ISR_FUNC(index)(void)                                                          \
	{                                                                                          \
		DT_INST_FOREACH_STATUS_OKAY_VARGS(HANDLE_IRQS, DT_INST_IRQN(index))                \
	}                                                                                          \
                                                                                                   \
	static void UTIL_CAT(ISR_FUNC(index), _init)(void)                                         \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQN(index), DT_INST_IRQ(index, priority), ISR_FUNC(index),    \
			    NULL, 0);                                                              \
		irq_enable(DT_INST_IRQN(index));                                                   \
	}

/*
 * Limit generating code to only the "first" instance:
 *
 * if (first_with_irqn(index) == index):
 *     generate_isr_code(index)
 */
#define GENERATE_ISR(index)                                                                        \
	COND_CODE_1(IS_EQ(index, FIRST_WITH_IRQN(index)), (GENERATE_ISR_CODE(index)), (EMPTY))

DT_INST_FOREACH_STATUS_OKAY(GENERATE_ISR)

/* Only "first" instances need to call the ISR setup function */
#define ADC_STM32_IRQ_FUNC(index)                                                                  \
	.irq_cfg_func = COND_CODE_1(IS_EQ(index, FIRST_WITH_IRQN(index)),                          \
				    (UTIL_CAT(ISR_FUNC(index), _init)), (NULL)),

#else /* !CONFIG_ADC_STM32_DMA || CONFIG_ADC_STM32_INJECTED_CHANNELS */

#define ADC_STM32_IRQ_FUNC(index)	.irq_cfg_func = NULL,

#endif /* !CONFIG_ADC_STM32_DMA || CONFIG_ADC_STM32_INJECTED_CHANNELS */

#define ADC_DMA_CHANNEL(id, src, dest)							\
	COND_CODE_1(DT_INST_DMAS_HAS_IDX(id, 0),					\
			(ADC_DMA_CHANNEL_INIT(id, src, dest)),				\
			(/* Required for other adc instances without dma */))

#define LIST_RESOLUTION(i, index)								\
	CONCAT(LL_ADC_RESOLUTION_, DT_INST_PROP_BY_IDX(index, st_adc_resolutions, i), B)

#define ADC_STM32_INIT(index)									\
												\
	ADC_STM32_CHECK_DT_CLOCK(index);							\
												\
	PINCTRL_DT_INST_DEFINE(index);								\
												\
	static const uint8_t table_raw_resolution##index[] =					\
		DT_INST_PROP(index, st_adc_resolutions);					\
												\
	static const uint32_t table_ll_resolution##index[] = {					\
		LISTIFY(DT_INST_PROP_LEN(index, st_adc_resolutions),				\
			LIST_RESOLUTION, (,), index),						\
	};											\
												\
	static const struct adc_stm32_cfg adc_stm32_cfg_##index = {				\
		.base = (ADC_TypeDef *)DT_INST_REG_ADDR(index),					\
		ADC_STM32_IRQ_FUNC(index)							\
		.pclken = STM32_DT_INST_CLOCK_INFO_BY_NAME(index, adcx),			\
		IF_ENABLED(DT_INST_CLOCKS_HAS_NAME(index, adc_ker),				\
			   (.pclken_ker = STM32_DT_INST_CLOCK_INFO_BY_NAME(index, adc_ker),	\
			    .has_pclken_ker = true,))						\
		IF_ENABLED(DT_INST_CLOCKS_HAS_NAME(index, adc_pre),				\
			   (.pclken_pre = STM32_DT_INST_CLOCK_INFO_BY_NAME(index, adc_pre),	\
			    .has_pclken_pre = true,))						\
		.clk_prescaler = ADC_STM32_DT_PRESC(index),					\
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),					\
		.differential_channels_used = (ANY_CHILD_NODE_IS_DIFFERENTIAL(index) > 0),	\
		.sequencer_type = CONCAT(SEQUENCER_,						\
			DT_INST_STRING_UPPER_TOKEN(index, st_adc_sequencer)),			\
		.oversampler_type = CONCAT(OVERSAMPLER_,					\
			DT_INST_STRING_UPPER_TOKEN(index, st_adc_oversampler)),			\
		.internal_regulator = CONCAT(INTERNAL_REGULATOR_,				\
			DT_INST_STRING_UPPER_TOKEN(index, st_adc_internal_regulator)),		\
		.has_deep_powerdown = DT_INST_PROP(index, st_adc_has_deep_powerdown),		\
		.has_channel_preselection =							\
			DT_INST_PROP(index, st_adc_has_channel_preselection),			\
		.has_differential_support =							\
			DT_INST_PROP(index, st_adc_has_differential_support),			\
		.has_injected_support = DT_INST_PROP(index, st_adc_has_injected_support),	\
		.sampling_time_table = DT_INST_PROP(index, sampling_times),			\
		.num_sampling_time_common_channels =						\
			DT_INST_PROP_OR(index, num_sampling_time_common_channels, 0),		\
		.table_resolution_size = DT_INST_PROP_LEN(index, st_adc_resolutions),		\
		.table_raw_resolution = table_raw_resolution##index,				\
		.table_ll_resolution = table_ll_resolution##index,				\
	};											\
												\
	static struct adc_stm32_data adc_stm32_data_##index = {					\
		ADC_CONTEXT_INIT_TIMER(adc_stm32_data_##index, ctx),				\
		ADC_CONTEXT_INIT_LOCK(adc_stm32_data_##index, ctx),				\
		ADC_CONTEXT_INIT_SYNC(adc_stm32_data_##index, ctx),				\
		IF_ENABLED(CONFIG_ADC_STM32_INJECTED_CHANNELS,					\
			   (ADC_CONTEXT_INIT_TIMER(adc_stm32_data_##index, inj_ctx),		\
			    ADC_CONTEXT_INIT_LOCK(adc_stm32_data_##index, inj_ctx),		\
			    ADC_CONTEXT_INIT_SYNC(adc_stm32_data_##index, inj_ctx),))		\
		ADC_DMA_CHANNEL(index, PERIPHERAL, MEMORY)					\
	};											\
												\
	PM_DEVICE_DT_INST_DEFINE(index, adc_stm32_pm_action);					\
												\
	DEVICE_DT_INST_DEFINE(index, adc_stm32_init,						\
			      PM_DEVICE_DT_INST_GET(index),					\
			      &adc_stm32_data_##index, &adc_stm32_cfg_##index,			\
			      POST_KERNEL, CONFIG_ADC_INIT_PRIORITY,				\
			      &api_stm32_driver_api);

DT_INST_FOREACH_STATUS_OKAY(ADC_STM32_INIT)
